Feature: raising exceptions

  Scenario Outline: handle <exception>
    Given unputed "<expression>" in entry
    When we press calculate button
    Then we will get "<exception>" exception



    Examples: exceptions
      | expression | exception                                                                         |
      | 2/0        | Ошибка во время вычисления / !                                                    |
      | sqrt(-1)   | Ошибка во время вычисления sqrt !                                                 |
      | ((2+1)     | В выражении не согласованы скобки!                                                |
      | 1..01 + 2  | Ошибка во время токенизации: Некорректное число!                                  |
      | 1.1!       | Ошибка во время вычисления ! !                                                    |
      | 1,1 + 2,2  | Проблема с разделителем - вероятно, использована десятичная запятая вместо точки! |

    Examples: strange inputs (issue 1)
      | expression                       | exception                                                                                  |
      | -1/-1.-log(1,2,3)                | Некорректное выражение!                                                                    |
      | (1.,-.1)                         | Ошибка во время токенизации: Некорректное использование запятой!                           |
      | (,1.,-.1)                        | Ошибка во время токенизации: Некорректное использование запятой!                           |
      | (,1.,-.1,)                       | Ошибка во время токенизации: Некорректное использование запятой!                           |
      | (,1.,-.1,)π                      | Ошибка во время токенизации: Некорректное использование запятой!                           |
      | (0.9)π^                          | Ошибка во время токенизации: Выражение не может заканчиваться оператором или разделителем! |
      | (0.9)π^-                         | Ошибка во время токенизации: Выражение не может заканчиваться оператором или разделителем! |
      | (0.9)π^-log(2,2,2,2)------------ | Ошибка во время токенизации: Некорректная последовательность операторов!                   |
      | (0.9)π^-log(5,4,3,2,2)--+-*/     | Ошибка во время токенизации: Некорректная последовательность операторов!                   |
      | (0.9)π^-log(5,4,3,2,2)--+-(1)    | Ошибка во время токенизации: Некорректная последовательность операторов!                   |
      | (0.9)7^----(1)                   | Ошибка во время токенизации: Некорректная последовательность операторов!                   |

